<template>
  <div class="q-px-sm q-ma-sm">
    <h1 class="text-primary">Родительский комитет</h1>
    <p class="subtitle1">
      Онлайн-сервис контроля своевременного внесения оплаты в родительский
      комитет и прозрачные отчеты по тратам для родителей учащихся.
    </p>
    <h2>Для кого этот сервис</h2>
    <p class="subtitle2">
      Сервис предлагает простой инструмент для учета взносов и контроля трат,
      поэтому будет интересен всем участникам процесса
    </p>
    <h2>Как пользоваться сервисом</h2>
    <p class="subtitle2">
      В целях безопасности в сервисе предусмотрено разделение прав доступа:
      администраторы и обычные пользователи. Администраторы могут добавлять
      приходные и расходные операции, осуществлять планирование и т.д.
    </p>
    <p class="subtitle2">
      Обычные пользователи могут управлять своим профилем и просматривать
      созданные администратором записи. Для тех, кто не желает регистрироваться
      существует возможность просмотреть публичную часть отчета, которая
      доступна по ссылке в режиме он-лайн. Ссылку к отчету может предоставить
      любой зарегистрированный пользователь или администратор.
    </p>
    <h2>Как зарегистрироваться</h2>
    <p class="subtitle2">
      В настоящий момент сервис закрыт для публичной регистрации, для
      регистрации необходимо приглашение от уже зарегистрированного
      администратора.
    </p>
  </div>
</template>

<script>
import { useMeta } from "quasar";
export default {
  name: "home-view",
  setup() {
    useMeta(() => {
      return {
        title: `Родительский комитет: сервис учета взносов и контроля трат`,
        meta: {
          description: {
            name: "description",
            content:
              "Онлайн-сервис для родительского комитета: учет взносов, контроль трат и доступный в реальном времени публичный отчет",
          },
          keywords: {
            name: "keywords",
            content: "Родительский комитет, расходы, учет, отчет",
          },
          equiv: {
            "http-equiv": "Content-Type",
            content: "text/html; charset=UTF-8",
          },
        },
      };
    });
  },
};
</script>

<style lang="scss"></style>
